# GIT - рапсределенная система контроля версий
# Это система для отслеживания и ведения истории изменения файлов, в вашем проекте

# Репозиторий (локальный/удаленный) - хранилище вашего кода и истории его изменений

# GitHub - веб сайт для размещения git-рпозиториев в совместной разработке

# Команды GIT:

# 1. git init -> она создает локальный гит репозиторий у ва на п, в той директории в которой была прописана команда. 

# 2. git status -> команда для проверки статуса наших файлов

# 3. git add -> команда для добавления файлов в систему отслеживания гита, после этой комнады изменения начинают фиксироваться 

# 4. git commit -m 'comment' -> комaнада для сохранения версии в локальном репозитории, вместе с комментарием к изменениеям

# 5. git remote add origin <url> -> это команда для того чтобы установить связь локального репозитория с удаленным в гитхабе

# 6. git push -> комнада для отправки ваших изменений в локальном репо в удалeнный репо
        # git push origin main



