# Типы данных в питоне

# 1. NoneType - ничего, пустота -> None
# 2. Boolean - Истина или ложь -> True/False
# 3. str() - Строки ->  "Hello world", 'Hello world'
# 4. Числовые типы данных
#     a) integer - int() - целое число -> -1, 2, 555
#     b) float() - Число с плавающей точкой -> 1.5, 15.2
#     c) complex() - 3+5i6 
# 5. Cписковые типы данных(коллекция)
#     a. list(массив/список) -> [5, 2, 4, True, 'hello']
#     b. tuple(кортеж) -> (1, 2, 3, None)
#     c. range(последовательность) -> range(1, 10)
# 6. set() -> множества -> {1,2,3,4,5,6,8}
# 7. dict(словари) -> содержат данные в себе в виде ключа и значения {1: 'one', 2: 'two'}

# ***************************************

# Mutable(изменяемые типы данных)
# 1. list
# 2. set
# 3. dict

# Immutable(неизменяемые типы данных)
# 1. Nonetype
# 2. boolean
# 3. int, float, complex
# 4. str
# 5. range
# 6. tuple
# 7. frozenset
# ----------------------------------

# num = 5
# stroka = 'Hello world! My name is John!'

'''Стандартный вывод данных'''
"""
в пайтоне для вывода данных в терминал используется
встроенная фукнция print() 
"""
# stroka = 'Hello world! My name is John Snow!'
# print(stroka)
# print(27+5)

"""
Стандартный ввод данных
через терминал 
используется фукнция input()
"""
# a = input('Введите число: ')
# print(a)
